package com.dengke.entity.common;

public class Constants {

    public static String SUBJECT_STATUS_OK = "1";
    public static String SUBJECT_STATUS_DEL = "2";

    public static String REPORT_FILE_PATH = "c:/files/";

    public static String SESSION_USER_NAME = "USER_NAME";
    public static String SESSION_START_EXAM_TIME = "START_EXAM_TIME";
    public static String SESSION_SUBJECTS = "SUBJECTS";
    public static String SESSION_REPORT = "REPORT";
    public static String SESSION_REPORT_DETAIL = "REPORT_DETAIL";


    public static String SESSION_USER_LOGIN = "USER_LOGIN";
    public static String SESSION_TOKEN = "TOKEN";

    public static int SUBJECT_TIME_VALUE = 10;
    public static int SUBJECT_TIME_MONITOR = 20;
    public static int SUBJECT_TIME_EFFECT = 30;

    public static String REPORT_SCORE_SPLIT = ";";

    public static int SUBJECT_SKILL_MANAGE = 5;
    public static int SUBJECT_SKILL_REVIEW = 10;
    public static int SUBJECT_SKILL_THINK = 15;
    public static int SUBJECT_SKILL_ASSIST = 20;
    public static int SUBJECT_SKILL_READ = 25;
    public static int SUBJECT_SKILL_WRITE = 30;
    public static int SUBJECT_SKILL_IN = 35;
    public static int SUBJECT_SKILL_HABIT = 40;

    public static int SUBJECT_ABL_PRE = 5;
    public static int SUBJECT_ABL_REVIEW = 10;
    public static int SUBJECT_ABL_LISTEN = 15;
    public static int SUBJECT_ABL_EXAM = 23;
    public static int SUBJECT_ABL_TIME = 28;

    public static int SUBJECT_SELF_OFFEN = 10;
    public static int SUBJECT_SELF_EFFECT = 20;
    public static int SUBJECT_SELF_LOVE = 30;
    public static int SUBJECT_SELF_OPEN = 35;
    public static int SUBJECT_SELF_STILL = 42;

    public static int SUBJECT_REASON_LESS = 7;
    public static int SUBJECT_REASON_MORE = 10;
    public static int SUBJECT_REASON_INTEREST = 15;
    public static int SUBJECT_REASON_TARGET = 20;

    public static int SUBJECT_STYLE_WORK = 11;
    public static int SUBJECT_STYLE_FEEL = 22;
    public static int SUBJECT_STYLE_INPUT = 33;
    public static int SUBJECT_STYLE_UNDERSTAND = 44;

    public static int SUBJECT_STATUS_KNOW = 5;
    public static int SUBJECT_STATUS_EMOTION = 10;
    public static int SUBJECT_STATUS_ACTION = 15;
    public static int SUBJECT_STATUS_INTEREST = 25;
    public static int SUBJECT_STATUS_REASON = 35;
    public static int SUBJECT_STATUS_ATTENTION = 40;
    public static int SUBJECT_STATUS_BELIEF = 45;


    public static String REPORT_TYPE_7_0_3="测试者的学习方法与技能水平较差。说明测试者在平时的学习中没有养成良好的学习习惯和掌握良好的学习方法与技巧。总体上，测试者缺乏对学习的管理和规划，没有一个明确的学习计划，即使有也很少能够坚持执行。在具体的学习方法上，测试者可能存在以下一个或几个方面的问题：没有养成复习习惯与掌握正确复习方法；缺乏思考或很少就学习问题参与讨论；很少借助辅助手段或请教他人进行学习；没有阅读的习惯或正确的阅读技巧；很少有做笔记的习惯或合理的笔记行为，考试心态不稳定或缺乏考试技巧；做题习惯与方法不恰当等。这些都会给测试者的学习带来一些不良影响，甚至就是导致学测试者学习不好的原因。测试者可以向自己的老师，同学询问改进学习方法的建议和经验，结合自己的实践来调整自己的学习方法，并坚持下去，才能取得好的学习效果";
    public static String REPORT_TYPE_7_3_7="测试者的学习方法和技能水平一般。测试者可能理解学习计划对于学习任务的重要意义，会时常制定学习计划，但是往往难以坚持完全执行计划。在具体的学习方法上，测试者具有一套习惯性的方法和程序，但是这些方法存在一些缺陷。测试者虽然可能知道许多行之有效的方法，但是还缺乏实践，没有养成习惯。如测试者在考试或做题上掌握了一些方法和技巧，但在实际学习中常常出现一些不良习惯；测试者养成了一定的阅读习惯，但是在阅读技巧上还有所欠缺等。上述这些行为特点导致测试者在学习活动中的效率不高，测试者往往在学习上花费的时间和精力并不少，但是却常常无法取得相应水平的学习成绩。测试者需要不断改进自己的学习方法，提高自己的学习能力。测试者可以向自己的老师，同学询问改进学习方法的建议和经验，结合自己的实践来调整自己的学习方法，并坚持下去，才能取得好的学习效果";
    public static String REPORT_TYPE_7_7_10="测试者的学习方法和技能水平优秀。说明测试者在平时的学习中具有非常好的学习习惯，并且掌握了很好的学习方法和技巧。测试者在学习管理与规划、复习习惯与方法、思考与讨论行为、辅助学习手段、阅读习惯与技巧、做笔记习惯与方法、考试心态与技巧、做题习惯与方法等方面都有很好的行为表现。测试者能够结合好的学习方法进行每一环节的学习，这些好的学习习惯和学习技巧也让学习者能够较为轻松的完成学习任务并取得较好的学习效果。希望测试者能够继续保持下去，家长和教师也应该对此多多给予肯定和鼓励。测试者需要注意的是，对于学习方法来说最为重要的不仅要知道方法，而且要贯彻和坚持执行方法。任何成效都需要逐步的积累，能够坚持才能取得实际的效果";
    public static String REPORT_TYPE_71_0_15="测试者的学习管理与规划能力较差。测试者可能理解学习计划对于学习任务的重要意义，会时常制定学习计划，但是往往难以坚持完全执行计划，在学习时间管理和分配上也还不太合理，有时难以按计划完成学习目标。测试者需要增强对时间的管理意识和学习计划的执行力，尤其是要注意合理分配时间，并定期检查自己计划的完成情况，这将有助于提高你的学习效果";
    public static String REPORT_TYPE_71_15_45="测试者的学习管理与规划能力一般。测试者可能理解学习计划对于学习任务的重要意义，会时常制定学习计划，但是往往难以坚持完全执行计划，在学习时间管理和分配上也还不太合理，有时难以按计划完成学习目标。测试者需要增强对时间的管理意识和学习计划的执行力，尤其是要注意合理分配时间，并定期检查自己计划的完成情况，这将有助于提高你的学习效果";
    public static String REPORT_TYPE_71_45_10="测试者的学习管理与规划能力优秀。测试者深深知道学习计划对于学习任务的重要意义，也会时常制定可行的学习计划，并坚持完全执行计划。测试者能够科学合理地对学习时间进行管理和分配，因此能够如期完成学习目标。测试者可以继续保持这种良好的学习时间管理能力和学习计划的执行力，这将有助于提高你的学习效果";
    public static String REPORT_TYPE_72_0_15="测试者在复习习惯和方法上表现较差。测试者还未意识到复习的重要作用，很少进行有计划的复习工作，没有养成课后复习的习惯和掌握正确的复习方法。由于被测试者的复习方法与复习习惯存在较大的缺陷，因此复习工作的效果较差，可能使日常的知识漏洞越积越多，最终会导致对整个知识内容的掌握水平偏低。因此，测试者应该加强复习意识和行为习惯的培养";
    public static String REPORT_TYPE_72_15_45="测试者在复习习惯和方法上表现一般。测试者可能意识到了复习的重要作用，但是还没有养成固定的复习习惯，在复习方法上也还有所欠缺。良好的复习习惯和方法对知识的巩固和掌握有重要帮助，测试者在这方面需要进一步加强";
    public static String REPORT_TYPE_72_45_10="测试者在复习习惯和方法上表现优秀。测试者有复习功课的好习惯，在平时的学习过程中，会及时复习老师所讲的课堂内容，并能运用高效的学习方法进行复习。测试者可以继续保持现有的好的复习习惯和方法，这对知识的巩固和掌握有重要帮助";
    public static String REPORT_TYPE_73_0_15="测试者在学习中的思考与讨论行为上表现较差。测试者在学习中缺乏观察和思考，缺少独立思考，没有自己的看法，在遇到不明白或重要的内容时，也很少与人讨论，不善于汲取别人好的学习方法。测试者需要加强独立思考和积极讨论等学习行为，多多汲取别人好的学习方法";
    public static String REPORT_TYPE_73_15_45="测试者在学习中的思考与讨论行为上表现一般。测试者在学习中有一定的思考意识和行为，但是有时可能会缺乏自己的看法，独立思考能力还有所欠缺。在遇到学习问题时，有时会找他人进行讨论，但还不够积极。测试者需要加强独立思考和积极讨论等学习行为，多多汲取别人好的学习方法";
    public static String REPORT_TYPE_73_45_10="测试者在学习中的思考与讨论行为上表现优秀。测试者在学习中注意观察和思考时，重视自己的看法，在遇到不明白或重要的内容时会格外注意听讲和理解。测试者喜欢与人讨论学习中遇到的问题，善于汲取别人好的学习方法。总之，测试者是一个善于思考，积极参与讨论的学习者，希望能够继续保持";
    public static String REPORT_TYPE_74_0_15="测试者的辅助学习手段较差。测试者在学习上方法较为单一，一般很少有借助其他工具或资料辅助学习的意识和行为，这常常导致测试者在遇到学习问题时会不知所措，使得测试者独立解决学习问题的能力差。测试者应该加强这方面的培养";
    public static String REPORT_TYPE_74_15_45="测试者的辅助学习手段一般。测试者能够利用一些基本的参考书、词典等工具书查阅所遇到的学习问题，也能简单借助一些实物、图像、表格等帮助理解学习内容，但是都还比较基础，还不能深层次地通过各学科之间的联系进行理解和学习";
    public static String REPORT_TYPE_74_45_10="测试者的辅助学习手段优秀。测试者能够能够巧妙利用参考书、词典等工具书解决学习问题，通过观察实物，借助图像、表格、流程图等帮助理解学习内容，并联系其他学科内容进行学习";
    public static String REPORT_TYPE_75_0_15="测试者的阅读习惯与技能较差。测试者在阅读学习材料时，缺乏提取有用信息的能力和方法，虽然完成了对材料的阅读过程，但是没有形成对阅读材料所要表达思想的明确认识。测试者在阅读时常常觉得难以集中精神，缺乏总结和思考，会对阅读材料产生不知所云的感觉。测试者可以逐渐的增加阅读量，培养阅读的技能，还可以通过对阅读过的文章进行讨论的形式来不断弥补自己阅读方法和技能的不足";
    public static String REPORT_TYPE_75_15_45="测试者的阅读习惯与技能一般。测试者在阅读学习材料时，能够提取一些简单的信息，能够顺利完成阅读过程，理解阅读材料的基本思想，但是测试者在阅读时有些缺乏总结和思考，对于不懂得地方含糊而过，有时不能深刻理解文章所要表达的思想。测试者需要再加强一些相关的阅读技能";
    public static String REPORT_TYPE_75_45_10="测试者的阅读习惯与技能优秀。测试者养成了广泛阅读的习惯，阅读文章时，喜欢边读边思考文章的意思，阅读中认为重要的或需要记住的地方，就划上线或做上记号。在阅读中若有不懂的地方，会记下来，非弄懂不可。这些好的阅读习惯和技巧会增强测试者的自学能力，有助于学习其他知识";
    public static String REPORT_TYPE_76_0_15="测试者对做笔记这项学习方法应用较差。测试者很少有做笔记的习惯，或是即使偶尔有做一些笔记也是要么直接记录教师说的原话，照抄黑板上的板书，要么就是做得比较混乱、缺乏逻辑，这样的笔记对于复习基本起不了作用。测试者首先需要养成一个定期做笔记的习惯，之后，不断加强一些记笔记的技巧";
    public static String REPORT_TYPE_76_15_45="测试者对做笔记这项学习方法应用一般。测试者往往是直接记录教师说的原话、黑板上的板书，较少根据自己的理解来组织自己的笔记形式和内容。由于笔记的内容较少包含自己的思路或者笔记不够整洁，所以笔记对于复习时的作用不是太大。测试者需要多多用自己的语言组织比较，加强记录的逻辑性";
    public static String REPORT_TYPE_76_45_10="测试者对做笔记这项学习方法应用优秀。测试者很少直接记录教师说的原话或直接抄写黑板上的板书，而是经常根据自己对学习内容的理解来用自己的语言来组织笔记形式和内容。测试者的笔记都是自己学习思路的反映，而且记录整洁，会定期进行笔记的归纳和整洁，这些对于今后的复习有很大的作用";
    public static String REPORT_TYPE_77_0_15="测试者的考试心态与技巧较差。测试者在应试期间，常常会感到紧张不安，不能像平常那样发挥应有的水平；或是因粗心大意没有仔细审题而犯错；有时也会由于缺乏技巧而卡在一些难题上而影响整个考试。总的来说，测试者应试能力欠佳，需要多多加强";
    public static String REPORT_TYPE_77_15_45="测试者的考试心态与技巧一般。测试者有一些好的考试习惯，考试时也有较为稳定的心理状态，基本能够调节紧张情绪，也掌握了一些基本的应试技巧，但是有时还会因为情绪紧张或一些粗心、没有掌握好的考试方法等原因导致出现一些考试失误。因此，测试者需要继续加强这方面的培养";
    public static String REPORT_TYPE_77_45_10="测试者的考试心态与技巧一般。测试者有一些好的考试习惯，考试时也有较为稳定的心理状态，基本能够调节紧张情绪，也掌握了一些基本的应试技巧，但是有时还会因为情绪紧张或一些粗心、没有掌握好的考试方法等原因导致出现一些考试失误。因此，测试者需要继续加强这方面的培养";
    public static String REPORT_TYPE_78_0_15="测试者在做题习惯与方法上表现较差。测试者看到题目就会直接动笔来做，缺少整体的设想和思考，常常抓不住题目的要点，而且也没有草稿的习惯，有时做一办发现才发现错了。如果有参考答案，测试者就会放弃思考，直接看答案再做题。这些不良的做题技巧和习惯会让测试者在考试中遇到难题就不知所措，做题也缺乏章法，导致很多不必要的考试失分。测试者需要逐步改掉这些不良习惯，养成好的做题技巧";
    public static String REPORT_TYPE_78_15_45="测试者在做题习惯与方法上表现一般。测试者在做题前会进行草稿演练，有时也会对题目进行整体设想，抓住要点后才开始解题，但有时就会直接下笔，缺少思考。测试者基本能够坚持独立解题，但有时遇到不会的题目时，会忍不住没有思考就去翻看答案。因此，测试者还需要加强一些做题技巧";
    public static String REPORT_TYPE_78_45_10="测试者在做题习惯与方法上表现优秀。测试者在动笔解题前，会先有个设想，然后抓住要点解题。做题前，经常先在草稿纸上算一遍。遇到实在不能独立解出习题，才会去看了答案再做。做好题目后会进行检查或验证。这些好的做题习惯和方法，会让测试者在考试中大大提高题目的准确率，从而取得好的成绩";

    public static String REPORT_TYPE_10_0_4="测试者的自主学习能力较低。测试者缺乏主动学习的意愿和行为，除非有人监督或督促，否则，测试者是不会去主动学习的。测试者在学习上比较消极，缺乏主动性和积极性，也不太喜欢学习，除了课堂和老师布置的学习任务，不愿意付出更多时间在学习中，有一些逃避和消极的学习行为。在自主学习方法上也有所欠缺，取得的学习效果也不太理想。总之，测试者需要加强自主学习能力的培养";
    public static String REPORT_TYPE_10_4_7="测试者的自主学习能力中等。测试者在完成老师布置的或课堂上的学习任务后，有一定的自主学习计划，会尝试主动去学习一些学校所学知识或自己感兴趣的知识，但在学习内容和方法上可能还有所局限。测试者在自主学习方面不能长久地坚持下去，有时会放弃或有所逃避，需要有他人进行提醒或督促。总之，测试者的自主学习能力一般，有些方面还需要进一步加强，详细结果可参考各因子结果分析";
    public static String REPORT_TYPE_10_7_10="测试者的自主学习能力水平较高。说明测试者是一个善于制定计划，积极主动去学习的人，即使在无人督促和监督的情况下，测试者依然能够独立地坚持学习，不仅限于完成老师布置的或课堂上的学习任务，更有自己的学习目标和计划，并能够采取正确有效的方法，多方面涉猎，学习不同的知识，尝试一些新的方法，并能够取得比较好的学习成果。测试者有着长远的学习目标，将学习贯穿于人生过程之中。总之，测试者具有高品质的学习状态，希望能够继续坚持和保持下去";
    public static String REPORT_TYPE_1_1_0_2="测试者的学习动机过弱。这个测验结果说明测试者在学习上具有这样一些表现：明显的惧怕学习，产生厌学情绪以及拖延、逃避学习的行为，严重时还会产生害怕老师，拒绝去学校上课的现象。测试者需要适当调整学习动机，使其上升到一定水平，从而才能提高学习效率，保证更好的学习效果。较弱的学习动机无法激发测试者学习的积极性，因此学习效率不高，对学习状况的改善也不利。缺乏学习动机可能是因为从学习当中获得过较多的负面评价，因此对学习积累了较多的负面情绪或者对学习缺乏必要的自信。此外，要想提高测试者的动机水平，测试者必须认清学习的意义和必要性，同时重新评价自己的能力，增强自信心、胜任感。测试者也需要培养良好的学习态度，坦然的面对失败，不要被失败的挫折感所困扰";
    public static String REPORT_TYPE_1_1_2_10="测试者目前不存在学习动机过弱的困扰。这个测验结果说明测试者在学习上不存在惧怕学习，厌学情绪以及拖延、逃避学习的行为。测试者对于自己的学习动机，保持现状即可，尽量保持平静，维持中度水平的学习动机，注意避免过强的学习动机带来的负面影响";
    public static String REPORT_TYPE_1_2_0_2="测试者的学习动机过强，这个测验结果说明测试者在学习上具有这样一些表现：迫切希望大幅度进步，且希望落空后会懊恼；花费过量时间学习以至于影响了正常的生活。测试者需要适当调整学习动机，使其下降到一定水平，从而才能提高学习效率，保证更好的学习效果。测试者在学习上要调整认知，认识到学习只是人生的一部分而非全部，同时合理进行预期，对结果尽量保持一颗平常心，不让学习影响到自己正常的生活";
    public static String REPORT_TYPE_1_2_2_10="测试者目前不存在学习动机过强困扰。这个测验结果说明测试者在学习上不存在迫切希望成功，过度追求学习结果，花费过量时间学习以至于影响了正常的生活等由于过强学习动机对生活带来的负面影响。测试者对于自己的学习动机，保持现状即可，尽量保持平静，维持中等水平的学习动机，注意避免由于缺乏学习动机所带来的缺乏学习动力的负面影响";
    public static String REPORT_TYPE_1_3_0_2="测试者的学习兴趣存在困扰，这个测验结果说明测试者在学习上具有这样一些表现：测试者学习的欲望较低，觉得学习没有乐趣，把学习看成是件很辛苦的事情。在学习知识，尤其是具有较高难度的知识的时候，容易半途而废，失败气馁，逃避学习。测试者要注意留心自己在学习兴趣方面的问题，针对具体问题，进行调整，从而提高学习兴趣。这可能是对学习内容缺乏兴趣所致。因此，测试者要学会利用自己的兴趣爱好，充分展现自己的特长，从而为自己赢得积极的肯定，激发学习的欲望。作为测试者的家长和教师，应当帮助测试者认清自己的能力长处以及在学习方法和实际努力方面的缺陷，增强其学习的信心，激发其学习的动力，不要过多的批评指责测试者，使其对学习更加缺乏兴趣和信心";
    public static String REPORT_TYPE_1_3_2_10="测试者目前不存在学习兴趣的困扰。这个测验结果说明测试者在学习上有较强的学习欲望，从学习中能够体会到乐趣，把学习看成一件快乐的事情，这样会使得测试者在学习中充满激情，愿意积极参与学习并坚持下去，喜欢参与由挑战性的学习任务。测试者对于自己的学习兴趣，要注意维持，使其能够达到持续的状态，尽量保持稳定";
    public static String REPORT_TYPE_1_4_0_2="测试者的学习目标存在困扰，这个测验结果说明测试者在学习上具有这样一些表现：在学习时，测试者不能合理分配时间和精力，没有合理且具有可操作性的目标，导致学习效率降低。测试者要注意留心自己在学习目标方面的问题，针对具体问题，进行调整，从而明确学习目标。测试者在学习时，需要合理分配时间和精力，制订合理且具有可操作性的目标，可以在大的总目标下，形成一个个小目标，提高学习效率";
    public static String REPORT_TYPE_1_4_2_10="测试者目前不存在学习目标的困扰。这个测验结果说明测试者具备一定的学习目标，并且相对合理，测试者能够合理分配时间和精力，从而保证较高的学习效率。测试者对于自己的学习目标，要注意维持，使其能够达到持续的状态，尽量保持稳定";
    public static String REPORT_TYPE_5_1_1="你的学习风格偏向主动型，你比较偏好与多人一起合作的团队学习，通过参与讨论、实际应用、给别人解释或讲解来掌握知识，遇到问题时会首先进行尝试。你希望在学习中有能够有更多参与的机会，小组学习、合作学习这些能够给你提供足够参与和讨论机会的学习形式是比较适合你的，也是你所喜欢的。如果你恰好处在一个没有时间进行讨论和问题求解的课堂上，在课外学习中，你可以选择自己喜欢的学习形式，尝试与同学一起组成学习小组、讨论小组或研究小组，一起组织学习活动，轮流承担不同的学习角色，围绕特定的学习主题开展讨论，解决问题，完成学习任务。\n" +
            "需要注意的是，主动型/反思型并不是完全对立的，两者在一个人身上同时存在，你所表现出的学习风格是占主导作用的风格类型。在面对不同的学习内容和任务，有时需要主动，有时需要反思，两者之间的平衡是需要把握的。如果你总是反思之前就开始任务，可能会因没有方向而花费很多不必要的精力；然而如果你花太多的时间反思，不去尝试，则可能无法将想法进行验证";
    public static String REPORT_TYPE_5_1_2="你的学习风格偏向反思型，喜欢独自一人完成工作，在遇到问题时更喜欢首先安静地思考问题。在课堂上，你希望老师能给留给你足够的独立思考的机会。如果在课堂上，不允许或很少或根本没有时间思考新的信息，你在后续的复习中或课外自主学习时应该尝试思考，以弥补这一不足，思考课堂学习中遇到的问题，用自己的语言写下思考结果或整理课堂笔记，这些方式将使你能够更有效地记忆和理解所学知识。\n" +
            "需要注意的是，主动型/反思型并不是完全对立的，两者在一个人身上同时存在，你所表现出的学习风格是占主导作用的风格类型。在面对不同的学习内容和任务，有时需要主动，有时需要反思，两者之间的平衡是需要把握的。如果你总是反思之前就开始任务，可能会因没有方向而花费很多不必要的精力；然而如果你花太多的时间反思，不去尝试，则可能无法将想法进行验证";
    public static String REPORT_TYPE_5_2_1="你的学习风格偏向感觉型，你较为偏好学习具体的事实，比较容易理解和接受与真实世界相关联的内容，不喜欢与现实生活没有明显联系的课程，讨厌在测试中出现一些在课堂里没有明确讲解过的内容。你对细节比较有耐心，擅长记忆事实和做一些常规的任务。在学习中，如果可以看到理论知识是如何与真实世界之间的联系，对于你对知识的记忆和理解是有利的。如果遇到大部分材料是抽象、理论的课程，你可能会遇到困难，你可以问问老师课程中有关概念和过程的具体例子，并找出如何在实践中运用它们。如果老师无法提供足够的细节，试图找一些其他参考资料或与朋友同学相互讨论来帮助学习。 \n" +
            "每个人都是有时是感觉型的，有时是直觉型的，只是有时候其中某一种的倾向程度不同。要成为一个有效的学习者和问题解决者，你要学会适应两种方式。如果你过于强调直觉作用，你会错过一些重要细节或是在计算和现成工作中犯粗心的毛病。如果你过于强调感觉的作用，你会过于依赖记忆和熟悉的方法，而不能充分地集中思想理解和创新";
    public static String REPORT_TYPE_5_2_2="你的学习风格偏向直觉型，你偏好发觉事物间的关联或可能性，喜欢以快速而创新的方法完成任务，不喜欢重复而规律的事物，不喜欢那些包括许多需要记忆和进行常规计算的课程。在学习中，如果你遇到涉及背诵和事实性知识较多的课程，你可能有麻烦与无聊，你可以向老师要求进行事实或理论的解释，或试图自己找到相应的知识之间的关联。你不耐烦的细节描述，不喜欢重复，在考试中可能容易粗心犯错，你可以在开始回答之前，花点时间来阅读整个问题，并且一定要检查结果。 \n" +
            "每个人都是有时是感觉型的，有时是直觉型的，只是有时候其中某一种的倾向程度不同。要成为一个有效的学习者和问题解决者，你要学会适应两种方式。如果你过于强调直觉作用，你会错过一些重要细节或是在计算和现成工作中犯粗心的毛病。如果你过于强调感觉的作用，你会过于依赖记忆和熟悉的方法，而不能充分地集中思想理解和创新";
    public static String REPORT_TYPE_5_3_1="你的学习风格偏向视觉型，学习过程中，在看到图片，图表，流程图，时间表，影片，或是实际演练时能够更好的记忆和理解知识，会有较佳的学习效果。\n" +
            "个体接受信息、进行学习，要借助不同的感觉器官，如凭耳朵听，用眼睛看等。不同的人对不同的感觉器官和感知通道有不同的偏爱，有些人更喜欢通过视觉的方式接受信息，也有一些人更喜欢通过听觉了解外在世界，从而掌握有关信息。心理学的有关研究表明，不同认知通道的学习效果是有差异的。一般地，只使用视觉通道，仅能记住材料的25%，只使用听觉通道，能记住材料的15%，而视听结合，使用多通道参与学习活动，则能记住材料的65%，这说明，视听结合的学习方式会帮助学习者记忆。随着教育信息化，多媒体教学已经得到普及，课堂教学从传统的黑板、教师讲述的听觉型教学模式走向文字、图像、音频、视频等视听结合的可听教学，不仅满足了不同类型学习者的学习偏好，也能促进学习者视听结合，多渠道获取和理解知识";
    public static String REPORT_TYPE_5_3_2="你的学习风格偏向听觉型，在学习过程中，文字说明、口述讲解的方式会让你更好地记忆、理解和掌握知识，从中取得较佳的学习效果。\n" +
            "个体接受信息、进行学习，要借助不同的感觉器官，如凭耳朵听，用眼睛看等。不同的人对不同的感觉器官和感知通道有不同的偏爱，有些人更喜欢通过视觉的方式接受信息，也有一些人更喜欢通过听觉了解外在世界，从而掌握有关信息。心理学的有关研究表明，不同认知通道的学习效果是有差异的。一般地，只使用视觉通道，仅能记住材料的25%，只使用听觉通道，能记住材料的15%，而视听结合，使用多通道参与学习活动，则能记住材料的65%，这说明，视听结合的学习方式会帮助学习者记忆。随着教育信息化，多媒体教学已经得到普及，课堂教学从传统的黑板、教师讲述的听觉型教学模式走向文字、图像、音频、视频等视听结合的可听教学，不仅满足了不同类型学习者的学习偏好，也能促进学习者视听结合，多渠道获取和理解知识";
    public static String REPORT_TYPE_5_4_1="你的学习风格偏向循序型，倾向于从头开始按部就班的进行学习，一步一步循着逻辑前进，按部就班地寻求问题的答案。在教学中，多数课程是以连续的方式授课的，这些都非常适合你的学习风格。但是，如果你的老师讲课时从一个主题跳到另一个，或跳过、省略了某些步骤，你可能遇到跟随上和记忆上的困难，这时，你需要及时询问老师来填充被跳过的步骤，或通过自己的查询参考来填补。当你自己在学习时，你可以花一些时间按逻辑顺序勾勒的课程的轮廓。你也可以尝试以加强你的全局思维技能，将每一个新的知识与你已经知道的东西相关联。你这样做的越多，对学习内容的理解也就会越深入。\n" +
            "你必须意识到，在掌握一个事物的细节之前，你需要对它具有一个全局的认知。如果你的老师，上课时直接切入到某个新的主题，而没有解释它是如何与你已经知道的事物之间的关联，则可能会导致你的问题。幸运的是，你可以采取一些有效的步骤帮助你更迅速地获得全局性的认知。在你开始研究在课文的某一章的第一部分时，通过对整章的浏览可以得到一个基本的了解。这样做可能在初始阶段会很费时，但它可以节省你一遍又一遍的浏览各部分的时间。你可能会发现长时间的沉浸在个别科目的大模块之中会更富有成效，而不是在每天晚上在每个主题上花很短的时间。无论是要求老师帮助或查询参考，尝试与你已经知道的东西建立关联。最重要的是，不要失去自信心，你最终会理解的新的事物。一旦你了解如何关联到其他的主题和学科的应用的方式，你就学习过程中就会变得很顺利";
    public static String REPORT_TYPE_5_4_2="你的学习风格偏向总体型，偏好跳跃式的学习，在学习过程中不太关注内容前后的关连性，习惯大步学习，吸收没有任何联系的随意的材料，然后突然顿悟。作为总体型学习风格的你相比循序型的学习者可能会更快地解决复杂问题，你常常能用新奇的方式将知识组合起来，但也会很难解释清楚他们是如何工作的。\n" +
            "你必须意识到，在掌握一个事物的细节之前，你需要对它具有一个全局的认知。如果你的老师，上课时直接切入到某个新的主题，而没有解释它是如何与你已经知道的事物之间的关联，则可能会导致你的问题。幸运的是，你可以采取一些有效的步骤帮助你更迅速地获得全局性的认知。在你开始研究在课文的某一章的第一部分时，通过对整章的浏览可以得到一个基本的了解。这样做可能在初始阶段会很费时，但它可以节省你一遍又一遍的浏览各部分的时间。你可能会发现长时间的沉浸在个别科目的大模块之中会更富有成效，而不是在每天晚上在每个主题上花很短的时间。无论是要求老师帮助或查询参考，尝试与你已经知道的东西建立关联。最重要的是，不要失去自信心，你最终会理解的新的事物。一旦你了解如何关联到其他的主题和学科的应用的方式，你就学习过程中就会变得很顺利";

}
